package ru.fafurin.lesson1;

// Урок 1. ArrayList
public class Main {
    public static void main(String[] args) {

// 1. Что такое компаратор?

// Ответ: Comparator - это интерфейс, используемый для сравнения объектов.
// Компараторы могут быть переданы методу сортировки (например, Collections.sort или Arrays.sort),
// чтобы обеспечить точный контроль над порядком сортировки. Компараторы также могут использоваться
// для управления порядком определенных структур данных (таких как отсортированные наборы или отсортированные карты)
// или для обеспечения упорядочения коллекций объектов, которые не имеют естественного порядка.

// 2. Что такое итератор?
// Ответ: Iterator - это интерфейс, который используется для обхода или пошагового выполнения коллекции.

// 3. Изучите исходники ArrayList.

    }
}
